app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-06-19 22:47:21.462988"], ["updated_at", "2019-06-19 22:47:21.462988"]]